/* automatically generated by rust-bindgen 0.71.1 */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[doc = r" If Bindgen could only determine the size and alignment of a"]
    #[doc = r" type, it is represented like this."]
    #[derive(PartialEq, Copy, Clone, Debug, Hash)]
    #[repr(C)]
    pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
    impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
        fn default() -> Self {
            Self([<T as Default>::default(); N])
        }
    }
    #[allow(unused_imports)]
    use self::super::root;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct i {
        pub j: *mut root::i,
        pub k: *mut root::i,
        pub l: bool,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of i"][::std::mem::size_of::<i>() - 24usize];
        ["Alignment of i"][::std::mem::align_of::<i>() - 8usize];
        ["Offset of field: i::j"][::std::mem::offset_of!(i, j) - 0usize];
        ["Offset of field: i::k"][::std::mem::offset_of!(i, k) - 8usize];
        ["Offset of field: i::l"][::std::mem::offset_of!(i, l) - 16usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct d {
        pub m: root::i,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of d"][::std::mem::size_of::<d>() - 24usize];
        ["Alignment of d"][::std::mem::align_of::<d>() - 8usize];
        ["Offset of field: d::m"][::std::mem::offset_of!(d, m) - 0usize];
    };
    pub const n_o: root::n = 0;
    pub const n_p: root::n = 1;
    pub const n_q: root::n = 2;
    pub const n_r: root::n = 3;
    pub const n_s: root::n = 4;
    pub const n_t: root::n = 5;
    pub const n_b: root::n = 6;
    pub const n_ae: root::n = 7;
    pub const n_e: root::n = 8;
    pub const n_ag: root::n = 9;
    pub const n_ah: root::n = 10;
    pub const n_ai: root::n = 11;
    pub type n = ::std::os::raw::c_uint;
    #[repr(C)]
    pub struct F {
        pub w: root::__BindgenOpaqueArray<u64, 33usize>,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of F"][::std::mem::size_of::<F>() - 264usize];
        ["Alignment of F"][::std::mem::align_of::<F>() - 8usize];
        ["Offset of field: F::w"][::std::mem::offset_of!(F, w) - 0usize];
    };
}
