/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        *self
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const FMOD_STUDIO_LOAD_MEMORY_ALIGNMENT: u32 = 32;
pub const FMOD_STUDIO_INIT_NORMAL: u32 = 0;
pub const FMOD_STUDIO_INIT_LIVEUPDATE: u32 = 1;
pub const FMOD_STUDIO_INIT_ALLOW_MISSING_PLUGINS: u32 = 2;

pub const FMOD_STUDIO_USER_PROPERTY_TYPE_STRING: FMOD_STUDIO_USER_PROPERTY_TYPE = 3;
pub const FMOD_STUDIO_USER_PROPERTY_TYPE_FORCEINT: FMOD_STUDIO_USER_PROPERTY_TYPE = 65536;
pub type FMOD_STUDIO_USER_PROPERTY_TYPE = ::std::os::raw::c_uint;
pub const FMOD_STUDIO_EVENT_PROPERTY_CHANNELPRIORITY: FMOD_STUDIO_EVENT_PROPERTY = 0;
pub const FMOD_STUDIO_EVENT_PROPERTY_SCHEDULE_DELAY: FMOD_STUDIO_EVENT_PROPERTY = 1;
pub const FMOD_STUDIO_EVENT_PROPERTY_SCHEDULE_LOOKAHEAD: FMOD_STUDIO_EVENT_PROPERTY = 2;
pub const FMOD_STUDIO_EVENT_PROPERTY_MINIMUM_DISTANCE: FMOD_STUDIO_EVENT_PROPERTY = 3;
pub const FMOD_STUDIO_EVENT_PROPERTY_MAXIMUM_DISTANCE: FMOD_STUDIO_EVENT_PROPERTY = 4;
pub const FMOD_STUDIO_EVENT_PROPERTY_COOLDOWN: FMOD_STUDIO_EVENT_PROPERTY = 5;
pub const FMOD_STUDIO_EVENT_PROPERTY_MAX: FMOD_STUDIO_EVENT_PROPERTY = 6;
pub const FMOD_STUDIO_EVENT_PROPERTY_FORCEINT: FMOD_STUDIO_EVENT_PROPERTY = 65536;
pub type FMOD_STUDIO_EVENT_PROPERTY = ::std::os::raw::c_uint;
pub const FMOD_STUDIO_PLAYBACK_PLAYING: FMOD_STUDIO_PLAYBACK_STATE = 0;
pub const FMOD_STUDIO_PLAYBACK_SUSTAINING: FMOD_STUDIO_PLAYBACK_STATE = 1;
pub const FMOD_STUDIO_PLAYBACK_STOPPED: FMOD_STUDIO_PLAYBACK_STATE = 2;
pub const FMOD_STUDIO_PLAYBACK_STARTING: FMOD_STUDIO_PLAYBACK_STATE = 3;
pub const FMOD_STUDIO_PLAYBACK_STOPPING: FMOD_STUDIO_PLAYBACK_STATE = 4;
pub const FMOD_STUDIO_PLAYBACK_FORCEINT: FMOD_STUDIO_PLAYBACK_STATE = 65536;
pub type FMOD_STUDIO_PLAYBACK_STATE = ::std::os::raw::c_uint;
pub const FMOD_STUDIO_STOP_ALLOWFADEOUT: FMOD_STUDIO_STOP_MODE = 0;
pub const FMOD_STUDIO_STOP_IMMEDIATE: FMOD_STUDIO_STOP_MODE = 1;
pub const FMOD_STUDIO_STOP_FORCEINT: FMOD_STUDIO_STOP_MODE = 65536;
pub type FMOD_STUDIO_STOP_MODE = ::std::os::raw::c_uint;
pub const FMOD_STUDIO_INSTANCETYPE_NONE: FMOD_STUDIO_INSTANCETYPE = 0;
pub const FMOD_STUDIO_INSTANCETYPE_SYSTEM: FMOD_STUDIO_INSTANCETYPE = 1;
pub const FMOD_STUDIO_INSTANCETYPE_EVENTDESCRIPTION: FMOD_STUDIO_INSTANCETYPE = 2;
pub const FMOD_STUDIO_INSTANCETYPE_EVENTINSTANCE: FMOD_STUDIO_INSTANCETYPE = 3;
pub const FMOD_STUDIO_INSTANCETYPE_PARAMETERINSTANCE: FMOD_STUDIO_INSTANCETYPE = 4;
pub const FMOD_STUDIO_INSTANCETYPE_BUS: FMOD_STUDIO_INSTANCETYPE = 5;
pub const FMOD_STUDIO_INSTANCETYPE_VCA: FMOD_STUDIO_INSTANCETYPE = 6;
pub const FMOD_STUDIO_INSTANCETYPE_BANK: FMOD_STUDIO_INSTANCETYPE = 7;
pub const FMOD_STUDIO_INSTANCETYPE_COMMANDREPLAY: FMOD_STUDIO_INSTANCETYPE = 8;
pub const FMOD_STUDIO_INSTANCETYPE_FORCEINT: FMOD_STUDIO_INSTANCETYPE = 65536;
pub type FMOD_STUDIO_INSTANCETYPE = ::std::os::raw::c_uint;
#[repr(C)]
pub struct FMOD_STUDIO_BANK_INFO {
    pub size: ::std::os::raw::c_int,
    pub userdata: *mut ::std::os::raw::c_void,
    pub userdatalength: ::std::os::raw::c_int,
    pub opencallback: FMOD_FILE_OPEN_CALLBACK,
    pub closecallback: FMOD_FILE_CLOSE_CALLBACK,
    pub readcallback: FMOD_FILE_READ_CALLBACK,
    pub seekcallback: FMOD_FILE_SEEK_CALLBACK,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_BANK_INFO"][::std::mem::size_of::<FMOD_STUDIO_BANK_INFO>() - 56usize];
    ["Alignment of FMOD_STUDIO_BANK_INFO"]
        [::std::mem::align_of::<FMOD_STUDIO_BANK_INFO>() - 8usize];
    ["Offset of field: FMOD_STUDIO_BANK_INFO::size"]
        [::std::mem::offset_of!(FMOD_STUDIO_BANK_INFO, size) - 0usize];
    ["Offset of field: FMOD_STUDIO_BANK_INFO::userdata"]
        [::std::mem::offset_of!(FMOD_STUDIO_BANK_INFO, userdata) - 8usize];
    ["Offset of field: FMOD_STUDIO_BANK_INFO::userdatalength"]
        [::std::mem::offset_of!(FMOD_STUDIO_BANK_INFO, userdatalength) - 16usize];
    ["Offset of field: FMOD_STUDIO_BANK_INFO::opencallback"]
        [::std::mem::offset_of!(FMOD_STUDIO_BANK_INFO, opencallback) - 24usize];
    ["Offset of field: FMOD_STUDIO_BANK_INFO::closecallback"]
        [::std::mem::offset_of!(FMOD_STUDIO_BANK_INFO, closecallback) - 32usize];
    ["Offset of field: FMOD_STUDIO_BANK_INFO::readcallback"]
        [::std::mem::offset_of!(FMOD_STUDIO_BANK_INFO, readcallback) - 40usize];
    ["Offset of field: FMOD_STUDIO_BANK_INFO::seekcallback"]
        [::std::mem::offset_of!(FMOD_STUDIO_BANK_INFO, seekcallback) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_PARAMETER_ID {
    pub data1: ::std::os::raw::c_uint,
    pub data2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_PARAMETER_ID"]
        [::std::mem::size_of::<FMOD_STUDIO_PARAMETER_ID>() - 8usize];
    ["Alignment of FMOD_STUDIO_PARAMETER_ID"]
        [::std::mem::align_of::<FMOD_STUDIO_PARAMETER_ID>() - 4usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_ID::data1"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_ID, data1) - 0usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_ID::data2"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_ID, data2) - 4usize];
};
#[repr(C)]
pub struct FMOD_STUDIO_PARAMETER_DESCRIPTION {
    pub name: *const ::std::os::raw::c_char,
    pub id: FMOD_STUDIO_PARAMETER_ID,
    pub minimum: f32,
    pub maximum: f32,
    pub defaultvalue: f32,
    pub type_: FMOD_STUDIO_PARAMETER_TYPE,
    pub flags: FMOD_STUDIO_PARAMETER_FLAGS,
    pub guid: FMOD_GUID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_PARAMETER_DESCRIPTION"]
        [::std::mem::size_of::<FMOD_STUDIO_PARAMETER_DESCRIPTION>() - 56usize];
    ["Alignment of FMOD_STUDIO_PARAMETER_DESCRIPTION"]
        [::std::mem::align_of::<FMOD_STUDIO_PARAMETER_DESCRIPTION>() - 8usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::name"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, name) - 0usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::id"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, id) - 8usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::minimum"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, minimum) - 16usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::maximum"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, maximum) - 20usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::defaultvalue"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, defaultvalue) - 24usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::type_"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, type_) - 28usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::flags"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, flags) - 32usize];
    ["Offset of field: FMOD_STUDIO_PARAMETER_DESCRIPTION::guid"]
        [::std::mem::offset_of!(FMOD_STUDIO_PARAMETER_DESCRIPTION, guid) - 36usize];
};
#[repr(C)]
pub struct FMOD_STUDIO_USER_PROPERTY {
    pub name: *const ::std::os::raw::c_char,
    pub type_: FMOD_STUDIO_USER_PROPERTY_TYPE,
    pub __bindgen_anon_1: FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1,
}
#[repr(C)]
pub struct FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1 {
    pub intvalue: __BindgenUnionField<::std::os::raw::c_int>,
    pub boolvalue: __BindgenUnionField<FMOD_BOOL>,
    pub floatvalue: __BindgenUnionField<f32>,
    pub stringvalue: __BindgenUnionField<*const ::std::os::raw::c_char>,
    pub bindgen_union_field: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1"]
        [::std::mem::size_of::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>() - 8usize];
    ["Alignment of FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1"]
        [::std::mem::align_of::<FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1>() - 8usize];
    ["Offset of field: FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1::intvalue"]
        [::std::mem::offset_of!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1, intvalue) - 0usize];
    ["Offset of field: FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1::boolvalue"]
        [::std::mem::offset_of!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1, boolvalue) - 0usize];
    ["Offset of field: FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1::floatvalue"]
        [::std::mem::offset_of!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1, floatvalue) - 0usize];
    ["Offset of field: FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1::stringvalue"]
        [::std::mem::offset_of!(FMOD_STUDIO_USER_PROPERTY__bindgen_ty_1, stringvalue) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_USER_PROPERTY"]
        [::std::mem::size_of::<FMOD_STUDIO_USER_PROPERTY>() - 24usize];
    ["Alignment of FMOD_STUDIO_USER_PROPERTY"]
        [::std::mem::align_of::<FMOD_STUDIO_USER_PROPERTY>() - 8usize];
    ["Offset of field: FMOD_STUDIO_USER_PROPERTY::name"]
        [::std::mem::offset_of!(FMOD_STUDIO_USER_PROPERTY, name) - 0usize];
    ["Offset of field: FMOD_STUDIO_USER_PROPERTY::type_"]
        [::std::mem::offset_of!(FMOD_STUDIO_USER_PROPERTY, type_) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES {
    pub name: *const ::std::os::raw::c_char,
    pub sound: *mut FMOD_SOUND,
    pub subsoundIndex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES"]
        [::std::mem::size_of::<FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES>() - 24usize];
    ["Alignment of FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES"]
        [::std::mem::align_of::<FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES>() - 8usize];
    ["Offset of field: FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES::name"]
        [::std::mem::offset_of!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES, name) - 0usize];
    ["Offset of field: FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES::sound"]
        [::std::mem::offset_of!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES, sound) - 8usize];
    ["Offset of field: FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES::subsoundIndex"]
        [::std::mem::offset_of!(FMOD_STUDIO_PROGRAMMER_SOUND_PROPERTIES, subsoundIndex) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES {
    pub name: *const ::std::os::raw::c_char,
    pub dsp: *mut FMOD_DSP,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES"]
        [::std::mem::size_of::<FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES>() - 16usize];
    ["Alignment of FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES"]
        [::std::mem::align_of::<FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES>() - 8usize];
    ["Offset of field: FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES::name"]
        [::std::mem::offset_of!(FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES, name) - 0usize];
    ["Offset of field: FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES::dsp"]
        [::std::mem::offset_of!(FMOD_STUDIO_PLUGIN_INSTANCE_PROPERTIES, dsp) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES {
    pub name: *const ::std::os::raw::c_char,
    pub position: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES"]
        [::std::mem::size_of::<FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES>() - 16usize];
    ["Alignment of FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES"]
        [::std::mem::align_of::<FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES>() - 8usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES::name"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES, name) - 0usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES::position"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_MARKER_PROPERTIES, position) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES {
    pub bar: ::std::os::raw::c_int,
    pub beat: ::std::os::raw::c_int,
    pub position: ::std::os::raw::c_int,
    pub tempo: f32,
    pub timesignatureupper: ::std::os::raw::c_int,
    pub timesignaturelower: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES"]
        [::std::mem::size_of::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>() - 24usize];
    ["Alignment of FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES"]
        [::std::mem::align_of::<FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES>() - 4usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES::bar"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES, bar) - 0usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES::beat"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES, beat) - 4usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES::position"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES, position) - 8usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES::tempo"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES, tempo) - 12usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES::timesignatureupper"][::std::mem::offset_of!(
        FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES,
        timesignatureupper
    ) - 16usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES::timesignaturelower"][::std::mem::offset_of!(
        FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES,
        timesignaturelower
    ) - 20usize];
};
#[repr(C)]
pub struct FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES {
    pub eventid: FMOD_GUID,
    pub properties: FMOD_STUDIO_TIMELINE_BEAT_PROPERTIES,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES"]
        [::std::mem::size_of::<FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES>() - 40usize];
    ["Alignment of FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES"]
        [::std::mem::align_of::<FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES>() - 4usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES::eventid"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES, eventid) - 0usize];
    ["Offset of field: FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES::properties"]
        [::std::mem::offset_of!(FMOD_STUDIO_TIMELINE_NESTED_BEAT_PROPERTIES, properties) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_ADVANCEDSETTINGS {
    pub cbsize: ::std::os::raw::c_int,
    pub commandqueuesize: ::std::os::raw::c_uint,
    pub handleinitialsize: ::std::os::raw::c_uint,
    pub studioupdateperiod: ::std::os::raw::c_int,
    pub idlesampledatapoolsize: ::std::os::raw::c_int,
    pub streamingscheduledelay: ::std::os::raw::c_uint,
    pub encryptionkey: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_ADVANCEDSETTINGS"]
        [::std::mem::size_of::<FMOD_STUDIO_ADVANCEDSETTINGS>() - 32usize];
    ["Alignment of FMOD_STUDIO_ADVANCEDSETTINGS"]
        [::std::mem::align_of::<FMOD_STUDIO_ADVANCEDSETTINGS>() - 8usize];
    ["Offset of field: FMOD_STUDIO_ADVANCEDSETTINGS::cbsize"]
        [::std::mem::offset_of!(FMOD_STUDIO_ADVANCEDSETTINGS, cbsize) - 0usize];
    ["Offset of field: FMOD_STUDIO_ADVANCEDSETTINGS::commandqueuesize"]
        [::std::mem::offset_of!(FMOD_STUDIO_ADVANCEDSETTINGS, commandqueuesize) - 4usize];
    ["Offset of field: FMOD_STUDIO_ADVANCEDSETTINGS::handleinitialsize"]
        [::std::mem::offset_of!(FMOD_STUDIO_ADVANCEDSETTINGS, handleinitialsize) - 8usize];
    ["Offset of field: FMOD_STUDIO_ADVANCEDSETTINGS::studioupdateperiod"]
        [::std::mem::offset_of!(FMOD_STUDIO_ADVANCEDSETTINGS, studioupdateperiod) - 12usize];
    ["Offset of field: FMOD_STUDIO_ADVANCEDSETTINGS::idlesampledatapoolsize"]
        [::std::mem::offset_of!(FMOD_STUDIO_ADVANCEDSETTINGS, idlesampledatapoolsize) - 16usize];
    ["Offset of field: FMOD_STUDIO_ADVANCEDSETTINGS::streamingscheduledelay"]
        [::std::mem::offset_of!(FMOD_STUDIO_ADVANCEDSETTINGS, streamingscheduledelay) - 20usize];
    ["Offset of field: FMOD_STUDIO_ADVANCEDSETTINGS::encryptionkey"]
        [::std::mem::offset_of!(FMOD_STUDIO_ADVANCEDSETTINGS, encryptionkey) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_CPU_USAGE {
    pub update: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_CPU_USAGE"][::std::mem::size_of::<FMOD_STUDIO_CPU_USAGE>() - 4usize];
    ["Alignment of FMOD_STUDIO_CPU_USAGE"]
        [::std::mem::align_of::<FMOD_STUDIO_CPU_USAGE>() - 4usize];
    ["Offset of field: FMOD_STUDIO_CPU_USAGE::update"]
        [::std::mem::offset_of!(FMOD_STUDIO_CPU_USAGE, update) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_BUFFER_INFO {
    pub currentusage: ::std::os::raw::c_int,
    pub peakusage: ::std::os::raw::c_int,
    pub capacity: ::std::os::raw::c_int,
    pub stallcount: ::std::os::raw::c_int,
    pub stalltime: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_BUFFER_INFO"][::std::mem::size_of::<FMOD_STUDIO_BUFFER_INFO>() - 20usize];
    ["Alignment of FMOD_STUDIO_BUFFER_INFO"]
        [::std::mem::align_of::<FMOD_STUDIO_BUFFER_INFO>() - 4usize];
    ["Offset of field: FMOD_STUDIO_BUFFER_INFO::currentusage"]
        [::std::mem::offset_of!(FMOD_STUDIO_BUFFER_INFO, currentusage) - 0usize];
    ["Offset of field: FMOD_STUDIO_BUFFER_INFO::peakusage"]
        [::std::mem::offset_of!(FMOD_STUDIO_BUFFER_INFO, peakusage) - 4usize];
    ["Offset of field: FMOD_STUDIO_BUFFER_INFO::capacity"]
        [::std::mem::offset_of!(FMOD_STUDIO_BUFFER_INFO, capacity) - 8usize];
    ["Offset of field: FMOD_STUDIO_BUFFER_INFO::stallcount"]
        [::std::mem::offset_of!(FMOD_STUDIO_BUFFER_INFO, stallcount) - 12usize];
    ["Offset of field: FMOD_STUDIO_BUFFER_INFO::stalltime"]
        [::std::mem::offset_of!(FMOD_STUDIO_BUFFER_INFO, stalltime) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_BUFFER_USAGE {
    pub studiocommandqueue: FMOD_STUDIO_BUFFER_INFO,
    pub studiohandle: FMOD_STUDIO_BUFFER_INFO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_BUFFER_USAGE"]
        [::std::mem::size_of::<FMOD_STUDIO_BUFFER_USAGE>() - 40usize];
    ["Alignment of FMOD_STUDIO_BUFFER_USAGE"]
        [::std::mem::align_of::<FMOD_STUDIO_BUFFER_USAGE>() - 4usize];
    ["Offset of field: FMOD_STUDIO_BUFFER_USAGE::studiocommandqueue"]
        [::std::mem::offset_of!(FMOD_STUDIO_BUFFER_USAGE, studiocommandqueue) - 0usize];
    ["Offset of field: FMOD_STUDIO_BUFFER_USAGE::studiohandle"]
        [::std::mem::offset_of!(FMOD_STUDIO_BUFFER_USAGE, studiohandle) - 20usize];
};
#[repr(C)]
pub struct FMOD_STUDIO_SOUND_INFO {
    pub name_or_data: *const ::std::os::raw::c_char,
    pub mode: FMOD_MODE,
    pub exinfo: FMOD_CREATESOUNDEXINFO,
    pub subsoundindex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_SOUND_INFO"][::std::mem::size_of::<FMOD_STUDIO_SOUND_INFO>() - 248usize];
    ["Alignment of FMOD_STUDIO_SOUND_INFO"]
        [::std::mem::align_of::<FMOD_STUDIO_SOUND_INFO>() - 8usize];
    ["Offset of field: FMOD_STUDIO_SOUND_INFO::name_or_data"]
        [::std::mem::offset_of!(FMOD_STUDIO_SOUND_INFO, name_or_data) - 0usize];
    ["Offset of field: FMOD_STUDIO_SOUND_INFO::mode"]
        [::std::mem::offset_of!(FMOD_STUDIO_SOUND_INFO, mode) - 8usize];
    ["Offset of field: FMOD_STUDIO_SOUND_INFO::exinfo"]
        [::std::mem::offset_of!(FMOD_STUDIO_SOUND_INFO, exinfo) - 16usize];
    ["Offset of field: FMOD_STUDIO_SOUND_INFO::subsoundindex"]
        [::std::mem::offset_of!(FMOD_STUDIO_SOUND_INFO, subsoundindex) - 240usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_COMMAND_INFO {
    pub commandname: *const ::std::os::raw::c_char,
    pub parentcommandindex: ::std::os::raw::c_int,
    pub framenumber: ::std::os::raw::c_int,
    pub frametime: f32,
    pub instancetype: FMOD_STUDIO_INSTANCETYPE,
    pub outputtype: FMOD_STUDIO_INSTANCETYPE,
    pub instancehandle: ::std::os::raw::c_uint,
    pub outputhandle: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_COMMAND_INFO"]
        [::std::mem::size_of::<FMOD_STUDIO_COMMAND_INFO>() - 40usize];
    ["Alignment of FMOD_STUDIO_COMMAND_INFO"]
        [::std::mem::align_of::<FMOD_STUDIO_COMMAND_INFO>() - 8usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::commandname"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, commandname) - 0usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::parentcommandindex"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, parentcommandindex) - 8usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::framenumber"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, framenumber) - 12usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::frametime"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, frametime) - 16usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::instancetype"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, instancetype) - 20usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::outputtype"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, outputtype) - 24usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::instancehandle"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, instancehandle) - 28usize];
    ["Offset of field: FMOD_STUDIO_COMMAND_INFO::outputhandle"]
        [::std::mem::offset_of!(FMOD_STUDIO_COMMAND_INFO, outputhandle) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FMOD_STUDIO_MEMORY_USAGE {
    pub exclusive: ::std::os::raw::c_int,
    pub inclusive: ::std::os::raw::c_int,
    pub sampledata: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FMOD_STUDIO_MEMORY_USAGE"]
        [::std::mem::size_of::<FMOD_STUDIO_MEMORY_USAGE>() - 12usize];
    ["Alignment of FMOD_STUDIO_MEMORY_USAGE"]
        [::std::mem::align_of::<FMOD_STUDIO_MEMORY_USAGE>() - 4usize];
    ["Offset of field: FMOD_STUDIO_MEMORY_USAGE::exclusive"]
        [::std::mem::offset_of!(FMOD_STUDIO_MEMORY_USAGE, exclusive) - 0usize];
    ["Offset of field: FMOD_STUDIO_MEMORY_USAGE::inclusive"]
        [::std::mem::offset_of!(FMOD_STUDIO_MEMORY_USAGE, inclusive) - 4usize];
    ["Offset of field: FMOD_STUDIO_MEMORY_USAGE::sampledata"]
        [::std::mem::offset_of!(FMOD_STUDIO_MEMORY_USAGE, sampledata) - 8usize];
};
pub type FMOD_STUDIO_SYSTEM_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        system: *mut FMOD_STUDIO_SYSTEM,
        type_: FMOD_STUDIO_SYSTEM_CALLBACK_TYPE,
        commanddata: *mut ::std::os::raw::c_void,
        userdata: *mut ::std::os::raw::c_void,
    ) -> FMOD_RESULT,
>;
pub type FMOD_STUDIO_EVENT_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        type_: FMOD_STUDIO_EVENT_CALLBACK_TYPE,
        event: *mut FMOD_STUDIO_EVENTINSTANCE,
        parameters: *mut ::std::os::raw::c_void,
    ) -> FMOD_RESULT,
>;
pub type FMOD_STUDIO_COMMANDREPLAY_FRAME_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        replay: *mut FMOD_STUDIO_COMMANDREPLAY,
        commandindex: ::std::os::raw::c_int,
        currenttime: f32,
        userdata: *mut ::std::os::raw::c_void,
    ) -> FMOD_RESULT,
>;
