/* automatically generated by rust-bindgen 0.71.1 */

pub const ALIGN_SIZE: u32 = 64;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __u32 = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct tcmu_mailbox {
    pub version: __u16,
    pub flags: __u16,
    pub cmdr_off: __u32,
    pub cmdr_size: __u32,
    pub cmd_head: __u32,
    pub cmd_tail: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tcmu_mailbox"][::std::mem::size_of::<tcmu_mailbox>() - 128usize];
    ["Alignment of tcmu_mailbox"][::std::mem::align_of::<tcmu_mailbox>() - 64usize];
    ["Offset of field: tcmu_mailbox::version"]
        [::std::mem::offset_of!(tcmu_mailbox, version) - 0usize];
    ["Offset of field: tcmu_mailbox::flags"][::std::mem::offset_of!(tcmu_mailbox, flags) - 2usize];
    ["Offset of field: tcmu_mailbox::cmdr_off"]
        [::std::mem::offset_of!(tcmu_mailbox, cmdr_off) - 4usize];
    ["Offset of field: tcmu_mailbox::cmdr_size"]
        [::std::mem::offset_of!(tcmu_mailbox, cmdr_size) - 8usize];
    ["Offset of field: tcmu_mailbox::cmd_head"]
        [::std::mem::offset_of!(tcmu_mailbox, cmd_head) - 12usize];
    ["Offset of field: tcmu_mailbox::cmd_tail"]
        [::std::mem::offset_of!(tcmu_mailbox, cmd_tail) - 64usize];
};
