/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_b {
    pub _address: u8,
}
unsafe extern "C" {
    #[link_name = "\u{1}c"]
    pub static mut _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_c: *mut a;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_d {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_g {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_g_context<e> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<e>>,
    pub c: e,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_i {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j {
    pub _address: u8,
}
pub type _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j_k =
    _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_g;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j"]
        [::std::mem::size_of::<_bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j>() - 1usize];
    ["Alignment of _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j"][::std::mem::align_of::<
        _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j,
    >() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_l {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_l"]
        [::std::mem::size_of::<_bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_l>() - 1usize];
    ["Alignment of _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_l"][::std::mem::align_of::<
        _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_l,
    >() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_g_open0__bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j__bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_i_close0"] [:: std :: mem :: size_of :: < _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_g > () - 1usize] ;
    ["Align of template specialization: _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_g_open0__bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j__bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_i_close0"] [:: std :: mem :: align_of :: < _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_g > () - 1usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct context {
    pub c: _bindgen_mod_id_1__bindgen_mod_id_2__bindgen_mod_id_3_j,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of context"][::std::mem::size_of::<context>() - 1usize];
    ["Alignment of context"][::std::mem::align_of::<context>() - 1usize];
    ["Offset of field: context::c"][::std::mem::offset_of!(context, c) - 0usize];
};
