/* automatically generated by rust-bindgen 0.71.1 */

pub type mbedtls_mpi_uint = ::std::os::raw::c_uint;
#[doc = " \\brief          MPI structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mbedtls_mpi {
    #[doc = "<  integer sign"]
    pub s: ::std::os::raw::c_int,
    #[doc = "<  total # of limbs"]
    pub n: ::std::os::raw::c_ulong,
    #[doc = "<  pointer to limbs"]
    pub p: *mut mbedtls_mpi_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mbedtls_mpi"][::std::mem::size_of::<mbedtls_mpi>() - 24usize];
    ["Alignment of mbedtls_mpi"][::std::mem::align_of::<mbedtls_mpi>() - 8usize];
    ["Offset of field: mbedtls_mpi::s"][::std::mem::offset_of!(mbedtls_mpi, s) - 0usize];
    ["Offset of field: mbedtls_mpi::n"][::std::mem::offset_of!(mbedtls_mpi, n) - 8usize];
    ["Offset of field: mbedtls_mpi::p"][::std::mem::offset_of!(mbedtls_mpi, p) - 16usize];
};
