/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Foo {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Foo"][::std::mem::size_of::<Foo>() - 0usize];
    ["Alignment of Foo"][::std::mem::align_of::<Foo>() - 1usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union jvalue {
    pub z: ::std::os::raw::c_uchar,
    pub p: *mut Foo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of jvalue"][::std::mem::size_of::<jvalue>() - 8usize];
    ["Alignment of jvalue"][::std::mem::align_of::<jvalue>() - 8usize];
    ["Offset of field: jvalue::z"][::std::mem::offset_of!(jvalue, z) - 0usize];
    ["Offset of field: jvalue::p"][::std::mem::offset_of!(jvalue, p) - 0usize];
};
