/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct chars {
    pub c: ::std::os::raw::c_char,
    pub uc: ::std::os::raw::c_uchar,
    pub sc: ::std::os::raw::c_schar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of chars"][::std::mem::size_of::<chars>() - 3usize];
    ["Alignment of chars"][::std::mem::align_of::<chars>() - 1usize];
    ["Offset of field: chars::c"][::std::mem::offset_of!(chars, c) - 0usize];
    ["Offset of field: chars::uc"][::std::mem::offset_of!(chars, uc) - 1usize];
    ["Offset of field: chars::sc"][::std::mem::offset_of!(chars, sc) - 2usize];
};
#[doc = " <div rustbindgen replaces=\"char\" />"]
pub type char = ::std::os::raw::c_uchar;
