/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1_basic_ios {
    pub _address: u8,
}
#[repr(C)]
pub struct _bindgen_mod_id_1_basic_ostream__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1_basic_ostream {
    pub vtable_: *const _bindgen_mod_id_1_basic_ostream__bindgen_vtable,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1_strstreambuf {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_mod_id_1_strstreambuf"]
        [::std::mem::size_of::<_bindgen_mod_id_1_strstreambuf>() - 1usize];
    ["Alignment of _bindgen_mod_id_1_strstreambuf"]
        [::std::mem::align_of::<_bindgen_mod_id_1_strstreambuf>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1_ostrstream {
    pub _base: _bindgen_mod_id_1_basic_ostream,
    pub _M_buf: _bindgen_mod_id_1_strstreambuf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_mod_id_1_ostrstream"]
        [::std::mem::size_of::<_bindgen_mod_id_1_ostrstream>() - 16usize];
    ["Alignment of _bindgen_mod_id_1_ostrstream"]
        [::std::mem::align_of::<_bindgen_mod_id_1_ostrstream>() - 8usize];
    ["Offset of field: _bindgen_mod_id_1_ostrstream::_M_buf"]
        [::std::mem::offset_of!(_bindgen_mod_id_1_ostrstream, _M_buf) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1_LogMessage {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_mod_id_1_LogMessage_LogStream {
    pub _base: _bindgen_mod_id_1_ostrstream,
    pub ctr_: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_mod_id_1_LogMessage_LogStream"]
        [::std::mem::size_of::<_bindgen_mod_id_1_LogMessage_LogStream>() - 16usize];
    ["Alignment of _bindgen_mod_id_1_LogMessage_LogStream"]
        [::std::mem::align_of::<_bindgen_mod_id_1_LogMessage_LogStream>() - 8usize];
    ["Offset of field: _bindgen_mod_id_1_LogMessage_LogStream::ctr_"]
        [::std::mem::offset_of!(_bindgen_mod_id_1_LogMessage_LogStream, ctr_) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_mod_id_1_LogMessage"]
        [::std::mem::size_of::<_bindgen_mod_id_1_LogMessage>() - 1usize];
    ["Alignment of _bindgen_mod_id_1_LogMessage"]
        [::std::mem::align_of::<_bindgen_mod_id_1_LogMessage>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: _bindgen_mod_id_1_basic_ostream_open0_char_char_close0"]
        [::std::mem::size_of::<_bindgen_mod_id_1_basic_ostream>() - 8usize];
    ["Align of template specialization: _bindgen_mod_id_1_basic_ostream_open0_char_char_close0"]
        [::std::mem::align_of::<_bindgen_mod_id_1_basic_ostream>() - 8usize];
};
