/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct example {
    pub field1: example_struct1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct example_struct1 {
    pub lh_first: *mut ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of example_struct1"][::std::mem::size_of::<example_struct1>() - 8usize];
    ["Alignment of example_struct1"][::std::mem::align_of::<example_struct1>() - 8usize];
    ["Offset of field: example_struct1::lh_first"]
        [::std::mem::offset_of!(example_struct1, lh_first) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of example"][::std::mem::size_of::<example>() - 8usize];
    ["Alignment of example"][::std::mem::align_of::<example>() - 8usize];
    ["Offset of field: example::field1"][::std::mem::offset_of!(example, field1) - 0usize];
};