/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
pub struct VirtualMethods__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VirtualMethods {
    pub vtable_: *const VirtualMethods__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VirtualMethods"][::std::mem::size_of::<VirtualMethods>() - 8usize];
    ["Alignment of VirtualMethods"][::std::mem::align_of::<VirtualMethods>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Set {
    pub bar: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ServoElementSnapshotTable {
    pub _base: Set,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ServoElementSnapshotTable"]
        [::std::mem::size_of::<ServoElementSnapshotTable>() - 4usize];
    ["Alignment of ServoElementSnapshotTable"]
        [::std::mem::align_of::<ServoElementSnapshotTable>() - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: Set_open0_VirtualMethods_close0"]
        [::std::mem::size_of::<Set>() - 4usize];
    ["Align of template specialization: Set_open0_VirtualMethods_close0"]
        [::std::mem::align_of::<Set>() - 4usize];
};